app/Services/Shop/CartService.php

    public function commit()
    {
        $this->_positions = collect([]);
        $this->_totalPrice = 0;
        $this->_totalQuantity = 0;

        foreach (Session::get($this::SESSION_KEY_PRODUCTS, []) as $productId => $options) {
            $product = Product::find($productId);
---
select * from `products` where `products`.`id` = '27length=' limit 1