app/Services/Shop/CartFormattedService.php

select * from `attribute_items` where `attribute_items`.`id` = 1 limit 1
select * from `option_items` where `option_items`.`id` = '1' limit 1
---
public function getFormattedOptionsText(array $options = [], bool $isFirst = true, \Illuminate\Support\Collection $collection, bool $excludeLength = false, bool $excludeSquare = false){
    $return = '';

    if(isset($options['attribute'])) {
        foreach ($options['attribute'] as $attributeId => $optionId) {
            $attributeItem = AttributeItem::find($attributeId);
            if($attributeItem) {
                $optionItem = OptionItem::find($optionId);