app/Services/EntityService.php

                    imagejpeg($im, $fullFilePath);
            }

            Photo::query()->create([
                'path'           => $tmpFile,
                'photoable_id'   => $item->id,
                'photoable_type' => get_class($item),
            ]);
---
insert into `photos` (`path`, `photoable_id`, `photoable_type`, `updated_at`, `created_at`) values ('102220240959596717779fe3c9d.png', 14, 'App\Models\Project', '2024-10-22 10:00:00', '2024-10-22 10:00:00')

    public function multiselectItems($productId, $type)
    {


        $items = Product::query()
            ->where('id', '!=', $productId)
            ->with('categories')
            ->orderBy('title', 'asc')
            ->get()
        ;

        $product = Product::find($productId);
        $relatedProducts = [];
        if ($product) {
            switch ($type) {
                case 'similar':
                    $relatedProducts = $product->similarProducts()->pluck('id')->toArray();
                    break;
                case 'related':
                    $relatedProducts = $product->relatedProducts()->pluck('id')->toArray();
---
select * from `products` where `id` != '24' order by `title` asc
select * from `products` where `products`.`id` = '24' limit 1
select `id` from `products` inner join `product_related_product` on `products`.`id` = `product_related_product`.`related_product_id` where `product_related_product`.`product_id` = 24