app/Actions/PostAction.php

select * from `posts` where `slug` = 'akcii' limit 1
select `photo_desktop`, `url` from `akcii_sliders` order by `sort` asc
---
    public function handle(string $slug, Request $request)
    {
		//print_r($slug);
        $post = Post::query()
            ->whereSlug($slug)
            ->firstOrFail();


        switch ($post['id']) {
            case (36)://Акции
            {
                $slider = AkciiSlider::select('photo_desktop', 'url')->orderBy('sort', 'ASC')->get();

select * from `calculators` where `active` = 1 order by `sort` desc
---
            }
            case (49):
            {//Калькуляторы
                $calculators = Calculator::active()->orderBy('sort', 'Desc')->get();