app/Http/Controllers/Index/BrandController.php

    public function index($id)
    {
        $products = Product::where('brand_id', $id)->get();
---
select * from `products` where `brand_id` = '5'