app/Http/Controllers/Index/GalleryController.php

select * from `projects` where `is_photo_project` = 1 order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `projects` where `is_photo_project` = 1
---
    public function index(Request $request)
    {
        $input = $request->all();
//        dd($input);
        $projects = Project::query()
            ->isPhotoProject()
            ->orderBy('created_at', 'desc')
            ->paginate(12)->withQueryString();