app/Http/Controllers/Index/HomeController.php

select * from `products` where `status_id` = 1 order by `sort` desc limit 100
select * from `index_sliders` order by `sort` asc
select * from `our_services` where `active` = 1
---
    public function index()
    {

        $sliderProducts = Product::query()
            ->statusActive()
            ->limit(100)
            ->with(['categories'])
            ->orderBy('sort', 'desc')
            ->get();
        $indexSliders = IndexSlider::query()
            ->orderBy('sort', 'asc')
            ->get();
        $ourServices = OurService::query()
            ->active()
            ->get();

select * from `posts` where `slug` = 'dokumenty' limit 1
select * from `tags_categories` where `entity` = 'dokumenty' order by `title` asc limit 1
select * from `files` inner join `files_tags` on `file_id` = `files`.`id` where `active` = '1' and `file_type_id` = 1 and `files_tags`.`tag_id` = '24' limit 20 offset 0
select count(*) as aggregate from `files` inner join `files_tags` on `file_id` = `files`.`id` where `active` = '1' and `file_type_id` = 1 and `files_tags`.`tag_id` = '24'
select * from `files` where `active` = '1' and `file_type_id` = 1 limit 20 offset 0
select count(*) as aggregate from `files` where `active` = '1' and `file_type_id` = 1
---
    public function documents($id, Request $request)
    {
        $post = Post::query()
            ->whereSlug('dokumenty')
            ->firstOrFail();
        $tagsModel = TagsCategories::query()
            ->where('entity', 'dokumenty')
            ->with('documentsTags')
            ->orderBy('title', 'asc')
            ->first();
        $tags = $tagsModel->documentsTags;
        if (isset($request->tagId)) {
            $files = File::where('active', '1')->where('file_type_id', 1)->
            where('files_tags.tag_id', $request->tagId)
                ->join('files_tags', 'file_id', 'files.id')->paginate(20)->withQueryString();
        } else {
            $files = File::where('active', '1')->where('file_type_id', 1)->paginate(20);