app/Http/Controllers/Index/PostController.php

select * from `post_categories` where `slug` = 'servis' limit 1
select `posts`.*, `post_category_post`.`post_category_id` as `pivot_post_category_id`, `post_category_post`.`post_id` as `pivot_post_id` from `posts` inner join `post_category_post` on `posts`.`id` = `post_category_post`.`post_id` where `post_category_post`.`post_category_id` = 1 and `active` = 1
---
    public function category(Request $request, $slug)
    {
        $postCategory = PostCategory::query()->where('slug', $slug)->first();
        $posts = $postCategory
            ->posts()
            ->active()
            ->get();

select * from `manager_contacts` limit 1
---
    public function sendMail(Request $request)
    {
        try {
            $typeOfRequest = $request->typeOfRequest ?? '';
            $address = $request->address;

            $link = $request->link ?? '';
            $phone = $request->phone_number;
            $comment = $request->comment;
            if ($request->has('file')) {

                $file = $request->file('file');
                $file_name = time() . '.' . $file->getClientOriginalExtension();
                $upload_path = public_path('upload_files');

                if (!file_exists($upload_path)) {
                    mkdir($upload_path, 0755, true);
                }

                $file->move(public_path('upload_files'), $file_name);

                Mail::send('posts.send_email', [], function ($message) use ($file, $file_name) {
                    $message->to(ManagerContacts::firstOrFail()->email, 'Manager')->subject('Консультация')
                        ->attach(public_path('upload_files/' . $file_name), ['as' => $file_name]);
                });
            } else {
                Mail::to(ManagerContacts::firstOrFail())->send(new SendMail($address, $phone, $comment, $typeOfRequest, $link));

            }
            $api = new SmsHelper (config('constants.apiname_SmsHelper'), config('constants.apikey_SmsHelper'), true, false);
            $result_sms = $api->sendSMS(preg_replace('/[^0-9]/', '', ManagerContacts::firstOrFail()->phone), $typeOfRequest, 'mkrostov');

select * from `files` where `active` = '1' and `file_type_id` = '3' limit 20 offset 0
select count(*) as aggregate from `files` where `active` = '1' and `file_type_id` = '3'
---
    public function FileFilter(Request $request)
    {


        if (isset($request->tagId)) {

            $files = File::where('active', '1')->where('file_type_id', $request->type)->where('files_tags.tag_id', $request->tagId)
                ->join('files_tags', 'file_id', 'files.id')->paginate(20)->withQueryString();
        } else {
            $files = File::where('active', '1')->where('file_type_id', $request->type)->paginate(20);

select * from `posts` where `slug` = 'vidy-pokrytiya' limit 1
---
    public function filter($slug, $request)
    {
        $post = Post::query()
            ->whereSlug($slug)
            ->firstOrFail();

select * from `coatings` order by `id` desc
---
        }

        $coatings = $result->get();
        return view('posts.show')->with(compact('post', 'coatings'));