app/Http/Controllers/Index/ProductController.php

    public function show($category, $product, ProductService $productService)
    {

        $category = ProductCategory::query()
            ->whereSlug($category)
            ->firstOrFail();


        $product = Product::query()
            ->statusActive()
            ->whereHas('categories', function ($qCategories) use ($category) {
                $qCategories->where('product_categories.id', $category->id);
            })
            ->whereSlug($product)
            ->with([
                'photos',
                'attributeItems',
                'attributeItems.attribute',
                'attributeItems.option',
                'relatedProducts' => function ($q) {
                    $q->orderBy('relSort', 'DESC');
                },
                'similarProducts' => function ($q) {
                    $q->orderBy('simSort', 'DESC');
                }
            ])
            ->firstOrFail();
---
select * from `product_categories` where `slug` = 'navesnoj-ventiliruemyj-fasad' limit 1
select * from `attribute_items` where `attribute_items`.`id` in (1, 9)
select `products`.*, `product_similar_product`.`product_id` as `pivot_product_id`, `product_similar_product`.`similar_product_id` as `pivot_similar_product_id` from `products` inner join `product_similar_product` on `products`.`id` = `product_similar_product`.`similar_product_id` where `product_similar_product`.`product_id` in (1) order by `simSort` desc


        for ($i = 0; $i < count($category_); $i++)
            foreach ($category_ as $value)
                    if ($value && $cat = ProductCategory::where('id',$value)->first())
---
select * from `product_categories` where `id` = 1 limit 1


        foreach ($category_ as $key => $value)
            if ($value)
                $category = ProductCategory::where('id',$key)->first();



        $sliderProducts = Product::query()
            ->statusActive()
            ->with(['categories'])
            ->orderBy('sort', 'desc')
            ->get();
---
select * from `product_categories` where `id` = 94 limit 1
select * from `products` where `status_id` = 1 order by `sort` desc

        $thickness = explode(" ", $product['thickness']);
//        dd($manufacturer);

        $viewedProducts = Product::query()
            ->whereIn('id', $viewedIds)
            ->where('id', '!=', $product->id)
            ->statusActive()
            ->with([
                'photos',
                'attributeItems',
                'attributeItems.attribute',
                'attributeItems.option',
                'relatedProducts'
            ])
            ->orderByRaw('FIELD(id, "' . implode(',', $viewedIds) . '")')
            ->get();
---
select * from `attribute_items` where `attribute_items`.`id` in (2, 9, 12, 13, 15, 20, 21, 37)
select `products`.*, `product_related_product`.`product_id` as `pivot_product_id`, `product_related_product`.`related_product_id` as `pivot_related_product_id` from `products` inner join `product_related_product` on `products`.`id` = `product_related_product`.`related_product_id` where `product_related_product`.`product_id` in (8, 28, 31)

        $itemAttributes = $product->attributeItems;
        $productAttributes = [];
        foreach ($itemAttributes as $attribute) {
            $product_attribute = ProductAttribute::where('product_id',$product->id)->where('option_item_id',$attribute->option->id)->first();
---
select * from `product_attributes` where `product_id` = 1 and `option_item_id` = 8 limit 1

    public function coatingShow($slug)
    {
        $coating = Coatings::query()
            ->whereSlug($slug)
            ->firstOrFail();

        $photos = $coating->photos;
        $firstPhoto = null;
        $threePhotos = [];
        $otherPhotos = [];
        foreach ($photos as $index => $photo) {
            if ($index == 0) {
                $firstPhoto = $photo;
            } else {
                $otherPhotos[] = $photo;
            }
        }

        $products = Product::where('coatings_id', $coating->id)->paginate(8);
---
select * from `coatings` where `slug` = 'purage' limit 1
select count(*) as aggregate from `products` where `coatings_id` = 44

    public function category(Request $request, $category)
    {

        $selected_tags = [];
        $selected_brands = [];
        if($request->get('tags'))
            foreach (explode(',',$request->get('tags')) as $tag){
                $selected_tags[] = $tag;
                $brand = BrandTags::where('tag_id',$tag)->get();
                if($brand)
                    foreach ($brand as $value)
                    $selected_brands[$value->brand_id] = $value->brand_id ;
            }



        $category = ProductCategory::query()
            ->whereSlug($category)
            ->firstOrFail();
---
select * from `product_categories` where `slug` = 'podsistema-nvf-ocinkovannaya' limit 1

    public function categoryList(Request $request, $category)
    {
        $category = ProductCategory::query()
            ->whereSlug($category)
            ->orderBy('sort', 'desc')
            ->firstOrFail();


        $category->load(['subcategories', 'subcategories.subcategories']);

        $sliderProducts = Product::query()
            ->statusActive()
            ->limit(5)
            ->with(['categories'])
            ->orderBy('sort', 'desc')
            ->get();

        return view('products.categoryList')->with(compact('category', 'sliderProducts'));
---
select * from `product_categories` where `slug` = 'fasad' order by `sort` desc limit 1
select * from `products` where `status_id` = 1 order by `sort` desc limit 5

    public function search(Request $request)
    {
        $query = $request->get('query');
//        if ($request->file_filter) {
//            dd($request->file_filter);
//        }
        $products = Product::query()
            ->statusActive()
            ->orderBy('sort', 'desc')
            ->where('title', 'LIKE', '%' . $query . '%')
            ->get();
---
select * from `products` where `status_id` = 1 and `title` LIKE '%%' order by `sort` desc

    public function favorites(Request $request, ProductService $productService)
    {
        $favoritesIds = $productService->getSession('favorites');

        // Добавляем кавычки вокруг значений
        $favoritesIdsList = implode(',', $favoritesIds);
        $favoritesIdsList = "'" . str_replace(",", "','", $favoritesIdsList) . "'";

        $products = Product::query()
            ->statusActive()
            ->whereIn('id', $favoritesIds)
            ->when(!empty($favoritesIds), function ($q) use ($favoritesIdsList) {
                return $q->orderByRaw('FIELD(id, ' . $favoritesIdsList . ')');
            })
            ->get();

        $title = 'Избранные товары';
        $pageType = 'favorites';
        return view('products.grid')->with(compact('products', 'title', 'pageType'));
---
select * from `products` where `status_id` = 1 and `id` in ('10', '29', '34') order by FIELD(id, '10','29','34')
select * from `products` where `status_id` = 1 and 0 = 1

    public function compare(Request $request, ProductService $productService)
    {
        $compareCoatings = [];
        $compareIds = $productService->getSession('compare');
        $categories = ProductCategory::query()
            ->whereHas('products', function ($q) use ($compareIds) {
                return $q
                    ->statusActive()
                    ->whereIn('id', $compareIds);
            })->withCount(['products' => function ($productsQ) use ($compareIds) {
                return $productsQ
                    ->statusActive()
                    ->whereIn('id', $compareIds);
            }])
            ->with(['products' => function ($productsQ) use ($compareIds) {
                return $productsQ
                    ->statusActive()
                    ->whereIn('id', $compareIds)
                    ->orderByDesc('sort');
            }])
            ->get();
---
select `products`.*, `product_product_category`.`product_category_id` as `pivot_product_category_id`, `product_product_category`.`product_id` as `pivot_product_id` from `products` inner join `product_product_category` on `products`.`id` = `product_product_category`.`product_id` where `product_product_category`.`product_category_id` in (1, 36, 61, 68, 94, 164, 240, 248, 259) and `status_id` = 1 and `id` in ('39', '3', '55', '54', '35', '28', '1', '47', '42', '31') order by `sort` desc