app/Http/Controllers/Index/ProductController.php

    public function favorites(Request $request, ProductService $productService)
    {
        $favoritesIds = $productService->getSession(ProductService::SESSION_FAVORITES);

        // Добавляем кавычки вокруг значений
        $favoritesIdsList = implode(',', $favoritesIds);
        $favoritesIdsList = "'" . str_replace(",", "','", $favoritesIdsList) . "'";

        $products = Product::query()
            ->statusActive()
            ->whereIn('id', $favoritesIds)
            ->when(!empty($favoritesIds), function ($q) use ($favoritesIdsList) {
                return $q->orderByRaw('FIELD(id, ' . $favoritesIdsList . ')');
            })
            ->get();
---
select * from `products` where `status_id` = 1 and `id` in ('3', '28') order by FIELD(id, '3','28')