app/Http/Controllers/Index/ProjectController.php

    public function show(Request $request, $slug)
    {
        $project = Project::query()->where('slug', $slug)->firstOrFail();
---
select * from `projects` where `slug` = 'testovyj-proekt' limit 1