app/Http/Controllers/Index/VideoYoutubeController.php

select * from `video_youtubes` where `video_youtubes`.`id` = '2' limit 1
---
    public function index($id)
    {

        $VideoYoutube = VideoYoutube::find($id);