app/Models/Product.php

select * from `products` where `is_promo` > 0 and `end_promo_date` > '2025-01-29 01:35:36'
---
    public static function getActivePromoProducts()
    {
        return self::where('is_promo', '>', 0)
            ->where('end_promo_date', '>', now())
            ->get();