app/Providers/AppServiceProvider.php

select * from `office_hours`
---
    public function boot()
    {
        Paginator::useBootstrap();

        // Отправка данных о режиме работы во все представления
        View::composer('layouts._footer', function ($view) {
            $officeHours = OfficeHour::all();