app/Providers/ViewServiceProvider.php

select * from `product_categories` where `parent_id` is null order by `sort` asc
select * from `product_categories` where `parent_id` is not null order by `sort` asc
select `posts`.*, `post_category_post`.`post_category_id` as `pivot_post_category_id`, `post_category_post`.`post_id` as `pivot_post_id` from `posts` inner join `post_category_post` on `posts`.`id` = `post_category_post`.`post_id` where `post_category_post`.`post_category_id` in (1, 2, 3) and `active` = 1 and `show_in_header` = 1 order by `sort` desc
---
    public function boot()
    {
        // cart
        view()->share('cart', app()->make('cart'));

        // auth user
        View::composer('admin.dashboard.index', function ($view) {
            $view->with(['user' => auth()->user()]);
        });

        // sidebar links
        View::composer('admin.layouts._sidebar', function ($view) {
            $config=[];
            if(\Auth::user()->hasRole('admin')){
                $config=config('admin.entities');
            }elseif (\Auth::user()->hasRole('manager')){
                $config=config('manager.entities');
            }
            $view->with(['entities' => $config]);
        });

        // header
        View::composer('layouts._header', function ($view) {
            $headerCategories = ProductCategory::whereNull('parent_id')->orderBy('sort', 'asc')->get();
            $headerSubCategories = ProductCategory::whereNotNull('parent_id')->orderBy('sort', 'asc')->get();

            $headerPostCategories = PostCategory::query()
                ->active()
                ->showInHeader()
                ->with(['posts' => function ($q) {
                    $q->active()->showInHeader()->orderByDesc('sort');
                }])->get();

select * from `post_categories` where `active` = 1 and `show_in_footer` = 1
select `posts`.*, `post_category_post`.`post_category_id` as `pivot_post_category_id`, `post_category_post`.`post_id` as `pivot_post_id` from `posts` inner join `post_category_post` on `posts`.`id` = `post_category_post`.`post_id` where `post_category_post`.`post_category_id` in (1, 2, 3) and `active` = 1 and `show_in_footer` = 1
---

        // footer
        View::composer('layouts._footer', function ($view) {
            $footerPostCategories = PostCategory::query()
                ->active()
                ->showInFooter()
                ->with(['posts' => function ($q) {
                    $q->active()->showInFooter();
                }])->get();